
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	ПечатьРасходногоКассовогоОрдера(ТабДок, ПараметрКоманды);
    КоллекцияПечФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("РасходныйКассовыйОрдер");
	КоллекцияПечФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечФорм[0].ПолныйПутьКМакету = "Документ.РасходныйКассовыйОрдер.ПФ_MXL_ПечатьРасходногоКассовогоОрдера"; 
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечФорм,ПараметрКоманды);

	
КонецПроцедуры

&НаСервере
Процедура ПечатьРасходногоКассовогоОрдера(ТабДок, ПараметрКоманды)
	Документы.РасходныйКассовыйОрдер.ПечатьРасходногоКассовогоОрдера(ТабДок, ПараметрКоманды);
КонецПроцедуры
