
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	ПечатьЗаказаКлиента(ТабДок, ПараметрКоманды);
    КоллекцияПечФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЗаказКлиента");
	КоллекцияПечФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечФорм[0].ПолныйПутьКМакету = "Документ.ЗаказКлиента.ПФ_MXL_ПечатьЗаказаКлиента"; 
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечФорм,ПараметрКоманды);
	
КонецПроцедуры

&НаСервере
Процедура ПечатьЗаказаКлиента(ТабДок, ПараметрКоманды)
	Документы.ЗаказКлиента.ПечатьЗаказаКлиента(ТабДок, ПараметрКоманды);
КонецПроцедуры
