
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Хозрасчетный 
	Движения.Хозрасчетный.Записывать = Истина;
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
	
	Если Валюта = ОсновнаяВалюта() Тогда
		Движение.СчетКт = ПланыСчетов.Хозрасчетный.КассаОрганизации;	
	Иначе	
		Движение.СчетКт = ПланыСчетов.Хозрасчетный.КассаОрганизацииВал;
		Движение.ВалютаКт = Валюта;
		Движение.ВалютнаяСуммаКт = РаботаСКурсамиВалют.ПересчитатьВВалюту(СуммаДокумента,Валюта,ОсновнаяВалюта(),Дата);
	КонецЕсли;

	Движение.Период = Дата;
	Движение.Сумма = СуммаДокумента;
	
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Поставщик;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		// Заполнение шапки
		Валюта = ДанныеЗаполнения.Валюта;
		Поставщик = ДанныеЗаполнения.Поставщик;
		Основание = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
	КонецЕсли;
	
КонецПроцедуры
