
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабДок = Новый ТабличныйДокумент;
	ПечатьНачисленияЗарплаты(ТабДок, ПараметрКоманды);
    КоллекцияПечФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("НачислениеЗарплаты");
	КоллекцияПечФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечФорм[0].ПолныйПутьКМакету = "Документ.НачислениеЗарплаты.ПФ_MXL_ПечатьНачисленияЗарплаты"; 
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечФорм,ПараметрКоманды);

КонецПроцедуры

&НаСервере
Процедура ПечатьНачисленияЗарплаты(ТабДок, ПараметрКоманды)
	Документы.НачислениеЗарплаты.ПечатьНачисленияЗарплаты(ТабДок, ПараметрКоманды);
КонецПроцедуры
