
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабДок = Новый ТабличныйДокумент;
	ПечатьУстановкаЦенНоменклатуры(ТабДок, ПараметрКоманды);
    КоллекцияПечФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("УстановкаЦенНоменклатуры");
	КоллекцияПечФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечФорм[0].ПолныйПутьКМакету = "Документ.УстановкаЦенНоменклатуры.ПФ_MXL_ПечатьУстановкаЦенНоменклатуры"; 
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечФорм,ПараметрКоманды);

	
КонецПроцедуры

&НаСервере
Процедура ПечатьУстановкаЦенНоменклатуры(ТабДок, ПараметрКоманды)
	Документы.УстановкаЦенНоменклатуры.ПечатьУстановкаЦенНоменклатуры(ТабДок, ПараметрКоманды);
КонецПроцедуры
