
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабДок = Новый ТабличныйДокумент;
	ПечатьСписаниеСРасчетногоСчета(ТабДок, ПараметрКоманды);
    КоллекцияПечФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("СписаниеСРасчетногоСчета");
	КоллекцияПечФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечФорм[0].ПолныйПутьКМакету = "Документ.СписаниеСРасчетногоСчета.ПФ_MXL_ПечатьСписаниеСРасчетногоСчета"; 
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечФорм,ПараметрКоманды);   
	
КонецПроцедуры

&НаСервере
Процедура ПечатьСписаниеСРасчетногоСчета(ТабДок, ПараметрКоманды)
	Документы.СписаниеСРасчетногоСчета.ПечатьСписаниеСРасчетногоСчета(ТабДок, ПараметрКоманды);
КонецПроцедуры
