
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	ПечатьПоступленияНаРасчетныйСчет(ТабДок, ПараметрКоманды);
    КоллекцияПечФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПоступлениеНаРасчетныйСчет");
	КоллекцияПечФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечФорм[0].ПолныйПутьКМакету = "Документ.ПоступлениеНаРасчетныйСчет.ПФ_MXL_ПечатьПоступленияНаРасчетныйСчет"; 
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечФорм,ПараметрКоманды);
	
КонецПроцедуры

&НаСервере
Процедура ПечатьПоступленияНаРасчетныйСчет(ТабДок, ПараметрКоманды)
	Документы.ПоступлениеНаРасчетныйСчет.ПечатьПоступленияНаРасчетныйСчет(ТабДок, ПараметрКоманды);
КонецПроцедуры
