
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	ПечатьПриходногоКассовогоОрдера(ТабДок, ПараметрКоманды);
    КоллекцияПечФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПриходныйКассовыйОрдер");
	КоллекцияПечФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечФорм[0].ПолныйПутьКМакету = "Документ.ПриходныйКассовыйОрдер.ПФ_MXL_ПриходныйКассовыйОрдер"; 
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечФорм,ПараметрКоманды);
	
КонецПроцедуры

&НаСервере
Процедура ПечатьПриходногоКассовогоОрдера(ТабДок, ПараметрКоманды)
	Документы.ПриходныйКассовыйОрдер.ПечатьПриходногоКассовогоОрдера(ТабДок, ПараметрКоманды);
КонецПроцедуры
