
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		// Заполнение шапки
		Валюта = ДанныеЗаполнения.Валюта;
		Получатель = ДанныеЗаполнения.Поставщик;
		Основание = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратОтКлиента") Тогда
		// Заполнение шапки
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		// Заполнение шапки
		Валюта = ДанныеЗаполнения.Валюта;
		Основание = ДанныеЗаполнения.Ссылка;
		Получатель = ДанныеЗаполнения.Поставщик;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
	КонецЕсли;
	
	
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Хозрасчетный 
	Движения.Хозрасчетный.Записывать = Истина;
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
	
	Если Валюта = ОсновнаяВалюта() Тогда
		Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетныеСчета;
		Движение.Сумма = СуммаДокумента;
	Иначе
		Движение.СчетКт = ПланыСчетов.Хозрасчетный.ВалютныеСчета;
		Движение.ВалютаКт = Валюта;
		Движение.ВалютнаяСуммаКт = СуммаДокумента;
		Движение.Сумма = РаботаСКурсамиВалют.ПересчитатьВВалюту(СуммаДокумента,Валюта,ОсновнаяВалюта(),Дата);
		Движение.ВалютнаяСуммаДт = СуммаДокумента;
	КонецЕсли;
	
	Движение.Период = Дата;
	Движение.ВалютаДт = Валюта;
	
	
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Получатель;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Характеристики] = Основание;

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
