
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабДок = Новый ТабличныйДокумент;
	ПечатьПоступленияТоваров(ТабДок, ПараметрКоманды);
    КоллекцияПечФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПоступлениеТоваров");
	КоллекцияПечФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечФорм[0].ПолныйПутьКМакету = "Документ.ПоступлениеТоваров.ПФ_MXL_ПечатьПоступленияТоваров"; 
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечФорм,ПараметрКоманды);
	
КонецПроцедуры

&НаСервере
Процедура ПечатьПоступленияТоваров(ТабДок, ПараметрКоманды)
	Документы.ПоступлениеТоваров.ПечатьПоступленияТоваров(ТабДок, ПараметрКоманды);
КонецПроцедуры
