// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПроверкаУникальностиЭлементаСправочника(НовыйЭлемент) Экспорт
	
	
	Если ЗначениеЗаполнено(НовыйЭлемент) Тогда
		
		Возврат Истина;	
		
	Иначе
		
		Возврат Ложь;	
		
	КонецЕсли;	
	
КонецФункции // ()
