&НаСервере
Функция ПроверитьРазрешениеУстановкиМетодаСписания () Экспорт 
	
ТекущееЗначение = РегистрыСведений.ИсторияИзмененийМетодаСписания.СрезПоследних(ТекущаяДата());

Если ТекущееЗначение.Количество() <> 0 Тогда 
	Если Год(ТекущееЗначение[0].ДатаУстановки) < Год(ТекущаяДата()) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь; 
	КонецЕсли;
Иначе
	Возврат Истина;	
КонецЕсли;

КонецФункции 

&НаСервере
Процедура ЗаписатьИсториюИзмененияМетодаСписания(МетодСписания) Экспорт 
	МенеджерЗаписи = РегистрыСведений.ИсторияИзмененийМетодаСписания.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДатаУстановки = ТекущаяДата();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.МетодСписания = МетодСписания;
	МенеджерЗаписи.Записать(Ложь);
КонецПроцедуры
