
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабДок = Новый ТабличныйДокумент;
	ПечатьРеализацияТоваров(ТабДок, ПараметрКоманды);
    КоллекцияПечФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("РеализацияТоваров");
	КоллекцияПечФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечФорм[0].ПолныйПутьКМакету = "Документ.РеализацияТоваров.ПФ_MXL_ПечатьРеализацияТоваров"; 
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечФорм,ПараметрКоманды);
	
КонецПроцедуры

&НаСервере
Процедура ПечатьРеализацияТоваров(ТабДок, ПараметрКоманды)
	Документы.РеализацияТоваров.ПечатьРеализацияТоваров(ТабДок, ПараметрКоманды);
КонецПроцедуры
