#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, НастройкиФормы) Экспорт

	 //ВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);

	 //ВариантыОтчетовПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);

 КонецПроцедуры

 
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	//Документы.ПриходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	//Документы.ПоступлениеНаРасчетныйСчет.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
КонецПроцедуры

Процедура ПечатьУстановкаОкладов(ТабДок, МассивОбъектов) Экспорт

	Макет = Документы.УстановкаОкладов.ПолучитьМакет("ПФ_MXL_ПечатьУстановкаОкладов");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УстановкаОкладовДок.Автор КАК Автор,
	|	УстановкаОкладовДок.Дата КАК Дата,
	|	УстановкаОкладовДок.Номер КАК Номер,
	|	УстановкаОкладовДок.УстановкаОкладов.(
	|		НомерСтроки КАК НомерСтроки,
	|		Сотрудник КАК Сотрудник,
	|		Подразделение КАК Подразделение,
	|		Оклад КАК Оклад
	|	) КАК УстановкаОкладов
	|ИЗ
	|	Документ.УстановкаОкладов КАК УстановкаОкладовДок
	|ГДЕ
	|	УстановкаОкладовДок.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.Параметры.Вставить("МассивОбъектов", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьУстановкаОкладовШапка = Макет.ПолучитьОбласть("УстановкаОкладовШапка");
	ОбластьУстановкаОкладов = Макет.ПолучитьОбласть("УстановкаОкладов");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьУстановкаОкладовШапка);
		ВыборкаУстановкаОкладов = Выборка.УстановкаОкладов.Выбрать();
		Пока ВыборкаУстановкаОкладов.Следующий() Цикл
			ОбластьУстановкаОкладов.Параметры.Заполнить(ВыборкаУстановкаОкладов);
			ТабДок.Вывести(ОбластьУстановкаОкладов, ВыборкаУстановкаОкладов.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
#КонецЕсли
