
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОкладыСотрудников
	Движения.ОкладыСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаУстановкаОкладов Из УстановкаОкладов Цикл
		Движение = Движения.ОкладыСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаУстановкаОкладов.Сотрудник;
		Движение.Подразделение = ТекСтрокаУстановкаОкладов.Подразделение;
		Движение.Оклад = ТекСтрокаУстановкаОкладов.Оклад;
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.ТекущийПользователь();	
	КонецЕсли;
КонецПроцедуры
