
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Покупатель;
		Основание = ДанныеЗаполнения.Ссылка;
		Валюта = ДанныеЗаполнения.Валюта;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Покупатель;
		Основание = ДанныеЗаполнения.Ссылка;
		Валюта = ДанныеЗаполнения.Валюта;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
	КонецЕсли;
	
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)


    // регистр Хозрасчетный 
    Движения.Хозрасчетный.Записывать = Истина;
    Движение = Движения.Хозрасчетный.Добавить();
	
	Если Валюта = ОсновнаяВалюта() Тогда
		Движение.СчетДт = ПланыСчетов.Хозрасчетный.КассаОрганизации;
		Движение.Сумма = СуммаДокумента;
	Иначе
		Движение.СчетДт = ПланыСчетов.Хозрасчетный.КассаОрганизацииВал;
		Движение.ВалютнаяСуммаДт = СуммаДокумента;
		Движение.ВалютаДт = Валюта;
		Движение.Сумма = РаботаСКурсамиВалют.ПересчитатьВВалюту(СуммаДокумента,Валюта,ОсновнаяВалюта(),Дата);
	КонецЕсли;
	
	Движение.ВалютнаяСуммаКт = СуммаДокумента;
    Движение.ВалютаКт = Валюта;
    Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
    Движение.Период = Дата;
    
    Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
	
    //{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
    // Данный фрагмент построен конструктором.
    // При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

    //}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
                         