
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабДок = Новый ТабличныйДокумент;
	ПечатьВозвратаОтКлиента(ТабДок, ПараметрКоманды);
    КоллекцияПечФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ВозвратОтКлиента");
	КоллекцияПечФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечФорм[0].ПолныйПутьКМакету = "Документ.ВозвратОтКлиента.ПФ_MXL_ПечатьВозвратаОтКлиента"; 
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечФорм,ПараметрКоманды);

КонецПроцедуры

&НаСервере
Процедура ПечатьВозвратаОтКлиента(ТабДок, ПараметрКоманды)
	Документы.ВозвратОтКлиента.ПечатьВозвратаОтКлиента(ТабДок, ПараметрКоманды);
КонецПроцедуры
