
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабДок = Новый ТабличныйДокумент;
	ПечатьУстановкаОкладов(ТабДок, ПараметрКоманды);
    КоллекцияПечФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("УстановкаОкладов");
	КоллекцияПечФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечФорм[0].ПолныйПутьКМакету = "Документ.УстановкаОкладов.ПФ_MXL_ПечатьУстановкаОкладов"; 
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечФорм,ПараметрКоманды);

КонецПроцедуры

&НаСервере
Процедура ПечатьУстановкаОкладов(ТабДок, ПараметрКоманды)
	Документы.УстановкаОкладов.ПечатьУстановкаОкладов(ТабДок, ПараметрКоманды);
КонецПроцедуры
