

Процедура ПередЗаписью(Отказ) 
	
НаименованиеНовогоЭлемента = Справочники.Номенклатура.НайтиПоНаименованию(Наименование);	
	
	Если ПроверкаСозданияЭлемента.ПроверкаУникальностиЭлементаСправочника(НаименованиеНовогоЭлемента) И НЕ ЗначениеЗаполнено(Код) Тогда 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Элемент с таким наименованием уже существует!";
		Сообщение.Поле = "Наименование";
	
		Сообщение.Сообщить();	
		
		Отказ = Истина;	 
		
	ИначеЕсли ПроверкаСозданияЭлемента.ПроверкаУникальностиЭлементаСправочника(НаименованиеНовогоЭлемента) И ЗначениеЗаполнено(Код) Тогда 
		
		Сообщить("Элемент изменен"); 
	Иначе
		
	    Сообщить("Элемент создан");	
		
	КонецЕсли;
		
	
КонецПроцедуры


